In [171]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [172]:
df = pd.read_csv("foreign_visitors_2016.csv")
df1 = pd.read_csv("foreign_visitors_2017.csv")
df2 = pd.read_csv("foreign_visitors_2018.csv")
df3 = pd.read_csv("foreign_visitors_2019.csv")

In [173]:
def head(n):
    return n.head()

def shape(n):
    return n.shape

def null(n):
    return n.isnull().sum()

def dupli(n):
    return n.duplicated().sum()

def info(n):
    return n.info()

In [174]:
print("2016 \n",head(df))
print("2017 \n",head(df1))
print("2018 \n",head(df2))
print("2019 \n",head(df3))

2016
    district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0
2  Adilabad  01-03-2016     March  2016        2
3  Adilabad  01-04-2016     April  2016        0
4  Adilabad  01-05-2016       May  2016        0
2017
    district        date     month  year visitors
0  Adilabad  01-01-2017   January  2017        5
1  Adilabad  01-02-2017  February  2017        0
2  Adilabad  01-03-2017     March  2017        0
3  Adilabad  01-04-2017     April  2017        0
4  Adilabad  01-05-2017       May  2017        0
2018
    district        date     month  year visitors
0  Adilabad  01-01-2018   January  2018        0
1  Adilabad  01-02-2018  February  2018        0
2  Adilabad  01-03-2018     March  2018        0
3  Adilabad  01-04-2018     April  2018        0
4  Adilabad  01-05-2018       May  2018        0
2019
    district        date     month  year visitors
0  Adilabad  01-01-2019   January  2019        0
1  Adilabad  01-02-2019  February  2019        2
2  Adilabad  01-03-2019     March  2019        0
3  Adilabad  01-04-2019     April  2019        0
4  Adilabad  01-05-2019       May  2019        0

In [175]:
print("2016 \n",shape(df))
print("2017 \n",shape(df1))
print("2018 \n",shape(df2))
print("2019 \n",shape(df3))

2016
 (372, 5)
2017
 (372, 5)
2018
 (372, 5)
2019
 (396, 5)

In [176]:
print("2016 \n",null(df))
print("2017 \n",null(df1))
print("2018 \n",null(df2))
print("2019 \n",null(df3))

2016
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2017
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2018
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2019
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [177]:
print("2016 \n",dupli(df))
print("2017 \n",dupli(df1))
print("2018 \n",dupli(df2))
print("2019 \n",dupli(df3))

2016
 0
2017
 0
2018
 0
2019
 0

In [178]:
print("2016 \n",info(df))
print("2017 \n",info(df1))
print("2018 \n",info(df2))
print("2019 \n",info(df3))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    object
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: int64(1), object(4)
memory usage: 14.7+ KB
2016
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    object
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: int64(1), object(4)
memory usage: 14.7+ KB
2017
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    object
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: int64(1), object(4)
memory usage: 14.7+ KB
2018
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  396 non-null    object
 1   date      396 non-null    object
 2   month     396 non-null    object
 3   year      396 non-null    int64
 4   visitors  396 non-null    object
dtypes: int64(1), object(4)
memory usage: 15.6+ KB
2019
 None

In [179]:
df['date'] = pd.to_datetime(df['date'])
df1['date'] = pd.to_datetime(df1['date'])
df2['date'] = pd.to_datetime(df2['date'])
df3['date'] = pd.to_datetime(df3['date'])

In [180]:
print("2016 \n",info(df))
print("2017 \n",info(df1))
print("2018 \n",info(df2))
print("2019 \n",info(df3))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2016
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2017
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2018
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  396 non-null    object
 1   date      396 non-null    datetime64[ns]
 2   month     396 non-null    object
 3   year      396 non-null    int64
 4   visitors  396 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 15.6+ KB
2019
 None

In [181]:
print("2016 \n",head(df))
print("2017 \n",head(df1))
print("2018 \n",head(df2))
print("2019 \n",head(df3))

2016
    district       date     month  year visitors
0  Adilabad 2016-01-01   January  2016        2
1  Adilabad 2016-01-02  February  2016        0
2  Adilabad 2016-01-03     March  2016        2
3  Adilabad 2016-01-04     April  2016        0
4  Adilabad 2016-01-05       May  2016        0
2017
    district       date     month  year visitors
0  Adilabad 2017-01-01   January  2017        5
1  Adilabad 2017-01-02  February  2017        0
2  Adilabad 2017-01-03     March  2017        0
3  Adilabad 2017-01-04     April  2017        0
4  Adilabad 2017-01-05       May  2017        0
2018
    district       date     month  year visitors
0  Adilabad 2018-01-01   January  2018        0
1  Adilabad 2018-01-02  February  2018        0
2  Adilabad 2018-01-03     March  2018        0
3  Adilabad 2018-01-04     April  2018        0
4  Adilabad 2018-01-05       May  2018        0
2019
    district       date     month  year visitors
0  Adilabad 2019-01-01   January  2019        0
1  Adilabad 2019-01-02  February  2019        2
2  Adilabad 2019-01-03     March  2019        0
3  Adilabad 2019-01-04     April  2019        0
4  Adilabad 2019-01-05       May  2019        0

In [182]:
print("2016 \n",info(df))
print("2017 \n",info(df1))
print("2018 \n",info(df2))
print("2019 \n",info(df3))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2016
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2017
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int64
 4   visitors  372 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 14.7+ KB
2018
 None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  396 non-null    object
 1   date      396 non-null    datetime64[ns]
 2   month     396 non-null    object
 3   year      396 non-null    int64
 4   visitors  396 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 15.6+ KB
2019
 None

In [183]:
Foreign_Visitors = pd.concat([df, df1, df2, df3], axis=0)

In [184]:
head(Foreign_Visitors)

   district       date     month  year visitors
0  Adilabad 2016-01-01   January  2016        2
1  Adilabad 2016-01-02  February  2016        0
2  Adilabad 2016-01-03     March  2016        2
3  Adilabad 2016-01-04     April  2016        0
4  Adilabad 2016-01-05       May  2016        0

In [185]:
shape(Foreign_Visitors)

(1512, 5)

In [186]:
Foreign_Visitors.tail()

            district       date      month  year visitors
391  Yadadri Bhongir 2019-01-08     August  2019        0
392  Yadadri Bhongir 2019-01-09  September  2019        0
393  Yadadri Bhongir 2019-01-10    October  2019        0
394  Yadadri Bhongir 2019-01-11   November  2019        0
395  Yadadri Bhongir 2019-01-12   December  2019        0

In [187]:
Foreign_Visitors.sample(10)

        district       date     month  year visitors
169       Medak  2016-01-02  February  2016        0
227       Nirmal 2016-01-12  December  2016        0
216       Nirmal 2016-01-01   January  2016
269  Ranga Reddy 2018-01-06      June  2018
247   Peddapalli 2018-01-08    August  2018        0
89    Kamareddy  2017-01-06      June  2017        0
117      Khammam 2017-01-10   October  2017        0
3       Adilabad 2019-01-04     April  2019        0
146  Mahbubnagar 2019-01-03     March  2019       28
299  Ranga Reddy 2019-01-12  December  2019

In [188]:
Foreign_Visitors.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [189]:
Foreign_Visitors.duplicated().sum()

0

In [190]:
Foreign_Visitors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1512 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1512 non-null   object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 70.9+ KB

In [191]:
Foreign_Visitors['year'] = Foreign_Visitors['year'].astype('int32')

In [193]:
# Foreign_Visitors['visitors'] = Foreign_Visitors['visitors'].astype('int32')
Foreign_Visitors['visitors'] = pd.to_numeric(Foreign_Visitors['visitors'], errors='coerce')

In [198]:
# Foreign_Visitors['visitors'] = Foreign_Visitors['visitors'].astype('int32')


import numpy as np

# Replace missing and infinite values with 0
Foreign_Visitors['visitors'].replace([np.inf, -np.inf], np.nan, inplace=True)
Foreign_Visitors['visitors'].fillna(0, inplace=True)

# Cast the column to an integer data type
Foreign_Visitors['visitors'] = Foreign_Visitors['visitors'].astype('int32')

In [199]:
Foreign_Visitors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1512 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int32
 4   visitors  1512 non-null   int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 59.1+ KB

In [201]:
Foreign_Visitors.head()

   district       date     month  year  visitors
0  Adilabad 2016-01-01   January  2016         2
1  Adilabad 2016-01-02  February  2016         0
2  Adilabad 2016-01-03     March  2016         2
3  Adilabad 2016-01-04     April  2016         0
4  Adilabad 2016-01-05       May  2016         0

In [202]:
Foreign_Visitors.tail()

            district       date      month  year  visitors
391  Yadadri Bhongir 2019-01-08     August  2019         0
392  Yadadri Bhongir 2019-01-09  September  2019         0
393  Yadadri Bhongir 2019-01-10    October  2019         0
394  Yadadri Bhongir 2019-01-11   November  2019         0
395  Yadadri Bhongir 2019-01-12   December  2019         0

In [217]:
Foreign_Visitors.sample(10)

                   district       date      month  year  visitors
26                Hyderabad 2019-01-03      March  2019     21929
229               Nizamabad 2016-01-02   February  2016         0
111                 Khammam 2019-01-04      April  2019         0
130  Komaram Bheem Asifabad 2018-01-11   November  2018         0
76        Jogulamba Gadwal  2019-01-05        May  2019        20
303                Suryapet 2017-01-04      April  2017         0
156              Mancherial 2017-01-01    January  2017         0
380        Warangal (Urban) 2019-01-09  September  2019       240
87               Kamareddy  2017-01-04      April  2017         0
13    Bhadradri Kothagudem  2017-01-02   February  2017         0

In [223]:
Foreign_Visitors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1512 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int32
 4   visitors  1512 non-null   int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 59.1+ KB

In [162]:
# pd.to_datetime(Foreign_Visitors[date])

In [218]:
Foreign_Visitors.to_csv("Foreign_Visitors.csv",index=False)

In [222]:
data = pd.read_csv("Foreign_Visitors.csv")
data.head()

   district        date     month  year  visitors
0  Adilabad  2016-01-01   January  2016         2
1  Adilabad  2016-01-02  February  2016         0
2  Adilabad  2016-01-03     March  2016         2
3  Adilabad  2016-01-04     April  2016         0
4  Adilabad  2016-01-05       May  2016         0

In [220]:
data.shape

(1512, 5)

In [221]:
data.date = pd.to_datetime(data.date)

In [138]:
print("Shape of the data", data.shape)
print("Top Five Rows of data \n", 
      data.head())

Shape of the data (1512, 5)
Top Five Rows of data
    district       date     month  year visitors
0  Adilabad 2016-01-01   January  2016        2
1  Adilabad 2016-01-02  February  2016        0
2  Adilabad 2016-01-03     March  2016        2
3  Adilabad 2016-01-04     April  2016        0
4  Adilabad 2016-01-05       May  2016        0

In [139]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   datetime64[ns]
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1512 non-null   object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 59.2+ KB

In [140]:
data.to_csv("Foreign_Visitors.csv",index=False)

In [141]:
data = pd.read_csv("Foreign_Visitors.csv")
data.head()

   district        date     month  year visitors
0  Adilabad  2016-01-01   January  2016        2
1  Adilabad  2016-01-02  February  2016        0
2  Adilabad  2016-01-03     March  2016        2
3  Adilabad  2016-01-04     April  2016        0
4  Adilabad  2016-01-05       May  2016        0

In [142]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1512 non-null   object
 1   date      1512 non-null   object
 2   month     1512 non-null   object
 3   year      1512 non-null   int64
 4   visitors  1512 non-null   object
dtypes: int64(1), object(4)
memory usage: 59.2+ KB